binhfile/raspi/app/pic/FreeRTOS/Source/portable/MPLAB/PIC18F/port.c
/*
 * The serial port ISR's are defined in serial.c, but are called from portable
 * as they use the same vector as the tick ISR.
 */
void vSerialTxISR( void );
void vSerialRxISR( void );

/*
 * Perform hardware setup to enable ticks.
 */
static void prvSetupTimerInterrupt( void );

/* 
 * ISR to maintain the tick, and perform tick context switches if the
 * preemptive scheduler is being used.
 */
static void prvTickISR( void );

/*
 * ISR placed on the low priority vector.  This calls the appropriate ISR for
 * the actual interrupt.
 */
#if defined(__XC8__)
static void interrupt prvLowInterrupt( void );
#else
static void prvLowInterrupt( void );
#endif

/* 
 * Macro that pushes all the registers that make up the context of a task onto
 * the stack, then saves the new top of stack into the TCB.
 * 
 * If this is called from an ISR then the interrupt enable bits must have been 
 * set for the ISR to ever get called.  Therefore we want to save the INTCON
 * register with the enable bits forced to be set - and ucForcedInterruptFlags 
 * must contain these bit settings.  This means the interrupts will again be
 * enabled when the interrupted task is switched back in.
 *
 * If this is called from a manual context switch (i.e. from a call to yield),
 * then we want to save the INTCON so it is restored with its current state,
 * and ucForcedInterruptFlags must be 0.  This allows a yield from within
 * a critical section.
 *
 * The compiler uses some locations at the bottom of the memory for temporary
 * storage during math and other computations.  This is especially true if
 * 32bit data types are utilised (as they are by the scheduler).  The .tmpdata
 * and MATH_DATA sections have to be stored in there entirety as part of a task
 * context.  This macro stores from data address 0x00 to 
 * portCOMPILER_MANAGED_MEMORY_SIZE.  This is sufficient for the demo 
 * applications but you should check the map file for your project to ensure 
 * this is sufficient for your needs.  It is not clear whether this size is 
 * fixed for all compilations or has the potential to be program specific.
 */
#if defined(__XC8__)
#define	portSAVE_CONTEXT_portINTERRUPTS_UNCHANGED								\
{																				\
		/* Save the status and WREG registers first, as these will get modified	\
		by the operations below. */												\
		asm("MOVFF	WREG, PREINC1		");											\
		asm("MOVFF   STATUS, PREINC1	");												\
		/* Save the INTCON register with the appropriate bits forced if			\
		necessary - as described above. */										\
		asm("MOVFF	INTCON, WREG			");										\
		asm("IORLW	0	");										\
		asm("MOVFF	WREG, PREINC1	");												\
																				\
	portDISABLE_INTERRUPTS();													\
																				\
		/* Store the necessary registers to the stack. */						\
		asm("MOVFF	BSR, PREINC1		");											\
		asm("MOVFF	FSR2L, PREINC1		");											\
		asm("MOVFF	FSR2H, PREINC1		");											\
		asm("MOVFF	FSR0L, PREINC1		");											\
		asm("MOVFF	FSR0H, PREINC1		");											\
		asm("MOVFF	TABLAT, PREINC1		");											\
		asm("MOVFF	TBLPTRU, PREINC1	");											\
		asm("MOVFF	TBLPTRH, PREINC1	");											\
		asm("MOVFF	TBLPTRL, PREINC1	");											\
		asm("MOVFF	PRODH, PREINC1		");											\
		asm("MOVFF	PRODL, PREINC1		");											\
		asm("MOVFF	PCLATU, PREINC1		");											\
		asm("MOVFF	PCLATH, PREINC1		");											\
		/* Store the .tempdata and MATH_DATA areas as described above. */		\
		asm("CLRF	FSR0L			");											\
		asm("CLRF	FSR0H			");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	INDF0, PREINC1");													\
		asm("MOVFF	FSR0L, PREINC1");													\
		asm("MOVFF	FSR0H, PREINC1");													\
		/* Store the hardware stack pointer in a temp register before we		\
		modify it. */															\
		asm("MOVFF	STKPTR, FSR0L");													\
																				\
		/* Store each address from the hardware stack. */						\
		while( STKPTR > ( uint8_t ) 0 )								\
		{																		\
				asm("MOVFF	TOSL, PREINC1");											\
				asm("MOVFF	TOSH, PREINC1");											\
				asm("MOVFF	TOSU, PREINC1");											\
				asm("POP");																\
		}																		\
																				\
		/* Store the number of addresses on the hardware stack (from the		\
		temporary register). */													\
		asm("MOVFF	FSR0L, PREINC1");													\
		asm("MOVF	PREINC1, f");													\
																				\
	/* Save the new top of the software stack in the TCB. */					\
		asm("MOVFF	_pxCurrentTCB, FSR0L");												\
		asm("MOVFF	_pxCurrentTCB + 1, FSR0H");											\
		asm("MOVFF	FSR1L, POSTINC0");													\
		asm("MOVFF	FSR1H, POSTINC0");													\
}
#define	portSAVE_CONTEXT_portGLOBAL_INTERRUPT_FLAG								\
{																				\
		/* Save the status and WREG registers first, as these will get modified	\
		by the operations below. */												\
		asm("MOVFF	WREG, PREINC1		");											\
		asm("MOVFF   STATUS, PREINC1	");												\
		/* Save the INTCON register with the appropriate bits forced if			\
		necessary - as described above. */										\
		asm("MOVFF	INTCON, WREG			");										\
		asm("IORLW	0x80	");										\
		asm("MOVFF	WREG, PREINC1	");												\
																				\
	portDISABLE_INTERRUPTS();													\
																				\
		/* Store the necessary registers to the stack. */						\
		asm("MOVFF	BSR, PREINC1		");											\
		asm("MOVFF	FSR2L, PREINC1		");											\
		asm("MOVFF	FSR2H, PREINC1		");											\
		asm("MOVFF	FSR0L, PREINC1		");											\
		asm("MOVFF	FSR0H, PREINC1		");											\
		asm("MOVFF	TABLAT, PREINC1		");											\
		asm("MOVFF	TBLPTRU, PREINC1	");											\
		asm("MOVFF	TBLPTRH, PREINC1	");											\
		asm("MOVFF	TBLPTRL, PREINC1	");											\
		asm("MOVFF	PRODH, PREINC1		");											\
		asm("MOVFF	PRODL, PREINC1		");											\
		asm("MOVFF	PCLATU, PREINC1		");											\
		asm("MOVFF	PCLATH, PREINC1		");											\
		/* Store the .tempdata and MATH_DATA areas as described above. */		\
		asm("CLRF	FSR0L			");											\
		asm("CLRF	FSR0H			");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1	");											\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	POSTINC0, PREINC1");												\
		asm("MOVFF	INDF0, PREINC1");													\
		asm("MOVFF	FSR0L, PREINC1");													\
		asm("MOVFF	FSR0H, PREINC1");													\
		/* Store the hardware stack pointer in a temp register before we		\
		modify it. */															\
		asm("MOVFF	STKPTR, FSR0L");													\
																				\
		/* Store each address from the hardware stack. */						\
		while( STKPTR > ( uint8_t ) 0 )								\
		{																		\
				asm("MOVFF	TOSL, PREINC1");											\
				asm("MOVFF	TOSH, PREINC1");											\
				asm("MOVFF	TOSU, PREINC1");											\
				asm("POP");																\
		}																		\
																				\
		/* Store the number of addresses on the hardware stack (from the		\
		temporary register). */													\
		asm("MOVFF	FSR0L, PREINC1");													\
		asm("MOVF	PREINC1, f");													\
																				\
	/* Save the new top of the software stack in the TCB. */					\
		asm("MOVFF	_pxCurrentTCB, FSR0L");												\
		asm("MOVFF	_pxCurrentTCB + 1, FSR0H");											\
		asm("MOVFF	FSR1L, POSTINC0");													\
		asm("MOVFF	FSR1H, POSTINC0");													\
}
#else
#define	portSAVE_CONTEXT( ucForcedInterruptFlags )								\
{																				\
	_asm																		\
		/* Save the status and WREG registers first, as these will get modified	\
		by the operations below. */												\
		MOVFF	WREG, PREINC1													\
		MOVFF   STATUS, PREINC1													\
		/* Save the INTCON register with the appropriate bits forced if			\
		necessary - as described above. */										\
		MOVFF	INTCON, WREG													\
		IORLW	ucForcedInterruptFlags											\
		MOVFF	WREG, PREINC1													\
	_endasm																		\
																				\
	portDISABLE_INTERRUPTS();													\
																				\
	_asm																		\
		/* Store the necessary registers to the stack. */						\
		MOVFF	BSR, PREINC1													\
		MOVFF	FSR2L, PREINC1													\
		MOVFF	FSR2H, PREINC1													\
		MOVFF	FSR0L, PREINC1													\
		MOVFF	FSR0H, PREINC1													\
		MOVFF	TABLAT, PREINC1													\
		MOVFF	TBLPTRU, PREINC1												\
		MOVFF	TBLPTRH, PREINC1												\
		MOVFF	TBLPTRL, PREINC1												\
		MOVFF	PRODH, PREINC1													\
		MOVFF	PRODL, PREINC1													\
		MOVFF	PCLATU, PREINC1													\
		MOVFF	PCLATH, PREINC1													\
		/* Store the .tempdata and MATH_DATA areas as described above. */		\
		CLRF	FSR0L, 0														\
		CLRF	FSR0H, 0														\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	POSTINC0, PREINC1												\
		MOVFF	INDF0, PREINC1													\
		MOVFF	FSR0L, PREINC1													\
		MOVFF	FSR0H, PREINC1													\
		/* Store the hardware stack pointer in a temp register before we		\
		modify it. */															\
		MOVFF	STKPTR, FSR0L													\
	_endasm																		\
																				\
		/* Store each address from the hardware stack. */						\
		while( STKPTR > ( uint8_t ) 0 )								\
		{																		\
			_asm																\
				MOVFF	TOSL, PREINC1											\
				MOVFF	TOSH, PREINC1											\
				MOVFF	TOSU, PREINC1											\
				POP																\
			_endasm																\
		}																		\
																				\
	_asm																		\
		/* Store the number of addresses on the hardware stack (from the		\
		temporary register). */													\
		MOVFF	FSR0L, PREINC1													\
		MOVF	PREINC1, 1, 0													\
	_endasm																		\
																				\
	/* Save the new top of the software stack in the TCB. */					\
	_asm																		\
		MOVFF	pxCurrentTCB, FSR0L												\
		MOVFF	pxCurrentTCB + 1, FSR0H											\
		MOVFF	FSR1L, POSTINC0													\
		MOVFF	FSR1H, POSTINC0													\
	_endasm																		\
}
#endif
/*-----------------------------------------------------------*/

