binhfile/raspi/app/pic/FreeRTOS/Source/portable/MPLAB/PIC18F/port.c
/*
 * This is the reverse of portSAVE_CONTEXT.  See portSAVE_CONTEXT for more
 * details.
 */
#if defined(__XC8__)
#define portRESTORE_CONTEXT()													\
{																				\
		/* Set FSR0 to point to pxCurrentTCB->pxTopOfStack. */					\
		asm("MOVFF	_pxCurrentTCB, FSR0L");												\
		asm("MOVFF	_pxCurrentTCB + 1, FSR0H");											\
																				\
		/* De-reference FSR0 to set the address it holds into FSR1.				\
		(i.e. *( pxCurrentTCB->pxTopOfStack ) ). */								\
		asm("MOVFF	POSTINC0, FSR1L");													\
		asm("MOVFF	POSTINC0, FSR1H");													\
																				\
		/* How many return addresses are there on the hardware stack?  Discard	\
		the first byte as we are pointing to the next free space. */			\
		asm("MOVFF	POSTDEC1, FSR0L");													\
		asm("MOVFF	POSTDEC1, FSR0L");													\
	/* Fill the hardware stack from our software stack. */						\
	STKPTR = 0;																	\
																				\
	while( STKPTR < FSR0L )														\
	{																			\
			asm("PUSH");																\
			asm("MOVF	POSTDEC1, w");												\
			asm("MOVWF	TOSU");														\
			asm("MOVF	POSTDEC1, w");												\
			asm("MOVWF	TOSH");														\
			asm("MOVF	POSTDEC1, w");												\
			asm("MOVWF	TOSL");														\
	}																			\
																				\
		/* Restore the .tmpdata and MATH_DATA memory. */						\
		asm("MOVFF	POSTDEC1, FSR0H");													\
		asm("MOVFF	POSTDEC1, FSR0L");													\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, POSTDEC0");												\
		asm("MOVFF	POSTDEC1, INDF0	");												\
		/* Restore the other registers forming the tasks context. */			\
		asm("MOVFF	POSTDEC1, PCLATH");												\
		asm("MOVFF	POSTDEC1, PCLATU");												\
		asm("MOVFF	POSTDEC1, PRODL	");												\
		asm("MOVFF	POSTDEC1, PRODH	");												\
		asm("MOVFF	POSTDEC1, TBLPTRL");												\
		asm("MOVFF	POSTDEC1, TBLPTRH");												\
		asm("MOVFF	POSTDEC1, TBLPTRU");												\
		asm("MOVFF	POSTDEC1, TABLAT");												\
		asm("MOVFF	POSTDEC1, FSR0H	");												\
		asm("MOVFF	POSTDEC1, FSR0L	");												\
		asm("MOVFF	POSTDEC1, FSR2H	");												\
		asm("MOVFF	POSTDEC1, FSR2L	");												\
		asm("MOVFF	POSTDEC1, BSR	");												\
		/* The next byte is the INTCON register.  Read this into WREG as some	\
		manipulation is required. */											\
		asm("MOVFF	POSTDEC1, WREG	");												\
																				\
	/* From the INTCON register, only the interrupt enable bits form part		\
	of the tasks context.  It is perfectly legitimate for another task to		\
	have modified any other bits.  We therefore only restore the top two bits.	\
	*/																			\
	if( WREG & portGLOBAL_INTERRUPT_FLAG )										\
	{																			\
			asm("MOVFF	POSTDEC1, STATUS");											\
			asm("MOVFF	POSTDEC1, WREG	");											\
			/* Return enabling interrupts. */									\
			asm("RETFIE");															\
	}																			\
	else																		\
	{																			\
			asm("MOVFF	POSTDEC1, STATUS");											\
			asm("MOVFF	POSTDEC1, WREG");												\
			/* Return without effecting interrupts.  The context may have		\
			been saved from a critical region. */								\
			asm("RETURN");															\
	}																			\
}
#else
#define portRESTORE_CONTEXT()													\
{																				\
	_asm																		\
		/* Set FSR0 to point to pxCurrentTCB->pxTopOfStack. */					\
		MOVFF	pxCurrentTCB, FSR0L												\
		MOVFF	pxCurrentTCB + 1, FSR0H											\
																				\
		/* De-reference FSR0 to set the address it holds into FSR1.				\
		(i.e. *( pxCurrentTCB->pxTopOfStack ) ). */								\
		MOVFF	POSTINC0, FSR1L													\
		MOVFF	POSTINC0, FSR1H													\
																				\
		/* How many return addresses are there on the hardware stack?  Discard	\
		the first byte as we are pointing to the next free space. */			\
		MOVFF	POSTDEC1, FSR0L													\
		MOVFF	POSTDEC1, FSR0L													\
	_endasm																		\
																				\
	/* Fill the hardware stack from our software stack. */						\
	STKPTR = 0;																	\
																				\
	while( STKPTR < FSR0L )														\
	{																			\
		_asm																	\
			PUSH																\
			MOVF	POSTDEC1, 0, 0												\
			MOVWF	TOSU, 0														\
			MOVF	POSTDEC1, 0, 0												\
			MOVWF	TOSH, 0														\
			MOVF	POSTDEC1, 0, 0												\
			MOVWF	TOSL, 0														\
		_endasm																	\
	}																			\
																				\
	_asm																		\
		/* Restore the .tmpdata and MATH_DATA memory. */						\
		MOVFF	POSTDEC1, FSR0H													\
		MOVFF	POSTDEC1, FSR0L													\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, POSTDEC0												\
		MOVFF	POSTDEC1, INDF0													\
		/* Restore the other registers forming the tasks context. */			\
		MOVFF	POSTDEC1, PCLATH												\
		MOVFF	POSTDEC1, PCLATU												\
		MOVFF	POSTDEC1, PRODL													\
		MOVFF	POSTDEC1, PRODH													\
		MOVFF	POSTDEC1, TBLPTRL												\
		MOVFF	POSTDEC1, TBLPTRH												\
		MOVFF	POSTDEC1, TBLPTRU												\
		MOVFF	POSTDEC1, TABLAT												\
		MOVFF	POSTDEC1, FSR0H													\
		MOVFF	POSTDEC1, FSR0L													\
		MOVFF	POSTDEC1, FSR2H													\
		MOVFF	POSTDEC1, FSR2L													\
		MOVFF	POSTDEC1, BSR													\
		/* The next byte is the INTCON register.  Read this into WREG as some	\
		manipulation is required. */											\
		MOVFF	POSTDEC1, WREG													\
	_endasm																		\
																				\
	/* From the INTCON register, only the interrupt enable bits form part		\
	of the tasks context.  It is perfectly legitimate for another task to		\
	have modified any other bits.  We therefore only restore the top two bits.	\
	*/																			\
	if( WREG & portGLOBAL_INTERRUPT_FLAG )										\
	{																			\
		_asm 																	\
			MOVFF	POSTDEC1, STATUS											\
			MOVFF	POSTDEC1, WREG												\
			/* Return enabling interrupts. */									\
			RETFIE	0															\
		_endasm																	\
	}																			\
	else																		\
	{																			\
		_asm 																	\
			MOVFF	POSTDEC1, STATUS											\
			MOVFF	POSTDEC1, WREG												\
			/* Return without effecting interrupts.  The context may have		\
			been saved from a critical region. */								\
			RETURN	0															\
		_endasm																	\
	}																			\
}
#endif
/*-----------------------------------------------------------*/

